remove_design -all
set search_path {../lib}
set target_library {lsi_10k.db}
set link_library "* lsi_10k.db"

analyze -format verilog {../rtl/mu.v} 

elaborate mu

link 

check_design

current_design  mu

compile_ultra

write_file -f verilog -hier -output mu_netlist.v